/*******************************************************************************
* タイトル:		フィールド処理
* プログラム名:	field.cpp
* 作成者:		TH教務部　寄光
* 作成日:		2015/10/20
********************************************************************************
* 更新履歴:		- 2015/10/20	 寄光
*					- V1.00		Initial Version
*******************************************************************************/
/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#ifndef _FIELD_H_
#define _FIELD_H_

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitField(void);
void UninitField(void);
void UpdateField(void);
void DrawField(void);


typedef struct
{
	D3DXVECTOR3 posField;													// 地面の位置
	D3DXVECTOR3 rotField;													// 地面の向き(回転)
	D3DXVECTOR3 sclField;													// 地面の大きさ(スケール)
}FIELD;

#endif
